{"class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"layers": [{"class_name": "Model", "config": {"output_layers": [["conv_7b_ac", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 299, 299, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [2, 2], "name": "conv2d_1", "trainable": false, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_2", "trainable": false, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_3", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": false}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 80, "strides": [1, 1], "name": "conv2d_4", "trainable": false, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 192, "strides": [1, 1], "name": "conv2d_5", "trainable": false, "padding": "valid", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": false}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"strides": [2, 2], "data_format": "channels_last", "trainable": false, "padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_9", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 48, "strides": [1, 1], "name": "conv2d_7", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 96, "strides": [1, 1], "name": "conv2d_10", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": false}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"strides": [1, 1], "data_format": "channels_last", "trainable": false, "padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 96, "strides": [1, 1], "name": "conv2d_6", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_8", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 96, "strides": [1, 1], "name": "conv2d_11", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_12", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": false}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed_5b", "config": {"axis": 3, "name": "mixed_5b", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_16", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_16", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_16", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_14", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_14", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 48, "strides": [1, 1], "name": "conv2d_17", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_17", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_13", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_13", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_15", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_18", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_18", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": false}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "block35_1_mixed", "config": {"axis": 3, "name": "block35_1_mixed", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]], "name": "block35_1_conv", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 320, "strides": [1, 1], "name": "block35_1_conv", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Lambda", "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]], "name": "block35_1", "config": {"function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpQL3Vzci9sb2NhbC9saWIvcHl0aG9uMy41\nL2Rpc3QtcGFja2FnZXMva2VyYXNfYXBwbGljYXRpb25zL2luY2VwdGlvbl9yZXNuZXRfdjIucHna\nCDxsYW1iZGE+qAAAAPMAAAAA\n", null, null], "name": "block35_1", "output_shape_type": "raw", "trainable": false, "function_type": "lambda", "output_shape": [35, 35, 320], "arguments": {"scale": 0.17}}}, {"class_name": "Activation", "inbound_nodes": [[["block35_1", 0, 0, {}]]], "name": "block35_1_ac", "config": {"activation": "relu", "name": "block35_1_ac", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_22", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_22", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_22", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_20", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_20", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 48, "strides": [1, 1], "name": "conv2d_23", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_20", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_23", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_19", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_19", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_21", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_24", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_19", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_21", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_24", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": false}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}]]], "name": "block35_2_mixed", "config": {"axis": 3, "name": "block35_2_mixed", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]], "name": "block35_2_conv", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 320, "strides": [1, 1], "name": "block35_2_conv", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Lambda", "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]], "name": "block35_2", "config": {"function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpQL3Vzci9sb2NhbC9saWIvcHl0aG9uMy41\nL2Rpc3QtcGFja2FnZXMva2VyYXNfYXBwbGljYXRpb25zL2luY2VwdGlvbl9yZXNuZXRfdjIucHna\nCDxsYW1iZGE+qAAAAPMAAAAA\n", null, null], "name": "block35_2", "output_shape_type": "raw", "trainable": false, "function_type": "lambda", "output_shape": [35, 35, 320], "arguments": {"scale": 0.17}}}, {"class_name": "Activation", "inbound_nodes": [[["block35_2", 0, 0, {}]]], "name": "block35_2_ac", "config": {"activation": "relu", "name": "block35_2_ac", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_28", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_28", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_28", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "config": {"activation": "relu", "name": "activation_28", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_26", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_26", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 48, "strides": [1, 1], "name": "conv2d_29", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_26", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_29", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "config": {"activation": "relu", "name": "activation_26", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29", "config": {"activation": "relu", "name": "activation_29", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_25", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_25", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "name": "conv2d_27", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": false, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "strides": [1, 1], "name": "conv2d_30", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_25", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_27", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": false, "beta_constraint": null, "name": "batch_normalization_30", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": false, "gamma_constraint": null, "axis": 3, "gamma_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27", "config": {"activation": "relu", "name": "activation_27", "trainable": false}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30", "config": {"activation": "relu", "name": "activation_30", "trainable": false}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_25", 0, 0, {}], ["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}]]], "name": "block35_3_mixed", "config": {"axis": 3, "name": "block35_3_mixed", "trainable": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_3_mixed", 0, 0, {}]]], "name": "block35_3_conv", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 320, "strides": [1, 1], "name": "block35_3_conv", "trainable": false, "padding": "same", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1]}}, {"class_name": "Lambda", "inbound_nodes": [[["block35_2_ac", 0, 0, {}],